# Charger les fichiers

In [136]:
import pandas as pd
import numpy as np

In [137]:
path = 'Data_use_case_Yelp/'

restaurants_file = path + 'restaurants.csv'
checkin_file = path + 'checkin.csv'
review_file = path + 'review.csv'
tip_file = path + 'tip.csv'
user_file = path + 'user.csv'
services_file = path + 'services.csv'
hours_file = path + 'hours.csv'

In [138]:
business = pd.read_csv(restaurants_file,on_bad_lines='skip', low_memory=False)
user = pd.read_csv(user_file, on_bad_lines='skip', low_memory=False)
review = pd.read_csv(review_file, on_bad_lines='skip',low_memory=False)
checkin = pd.read_csv(checkin_file, on_bad_lines='skip',low_memory=False)
tip = pd.read_csv(tip_file, on_bad_lines='skip',low_memory=False)
services = pd.read_csv(services_file,on_bad_lines='skip',low_memory=False)
hours = pd.read_csv(hours_file, on_bad_lines='skip',low_memory=False)

## Nettoyage de code, filtrage et plus

In [139]:
#Colonnes à garder business
business = business[[
    "business_id", "nom", "moyenne_etoiles", "ville", "zone", "ferme"
]]
business.head()

,business_id,nom,moyenne_etoiles,ville,zone,ferme
0,lCwqJWMxvIUQt1Re_tDn4w,Denny's,2.5,Las Vegas,89110,0
1,pd0v6sOqpLhFJ7mkpIaixw,Ike's Love & Sandwiches,4.0,Phoenix,85004,0
2,0vhi__HtC2L4-vScgDFdFw,Midori Japanese Cafe,3.5,Calgary,T2T,0
3,t65yfB9v9fqlhAkLnnUXdg,Pho U,3.5,Toronto,M5A,0
4,i7_JPit-2kAbtRTLkic2jA,John & Sons Oyster House,4.0,Toronto,M5H,0

In [176]:
business_ouverts = business[business["ferme"] == 0][["business_id", "ferme"]]
business_ouverts.head()

              business_id  ferme
0  lCwqJWMxvIUQt1Re_tDn4w      0
1  pd0v6sOqpLhFJ7mkpIaixw      0
3  t65yfB9v9fqlhAkLnnUXdg      0
4  i7_JPit-2kAbtRTLkic2jA      0
5  vMh4madPU3qhNX7P7d8WGA      0

In [141]:
#Colonnes à garder pour review
review_cols = ["review_id","user_id","business_id","etoiles","useful","funny","cool","date"
]
review.head()

,review_id,user_id,business_id,etoiles,useful,funny,cool,date
0,yi0R0Ugj_xUx_Nek0-_Qig,dacAIZ6fTM6mqwW5uxkskg,ikCg8xy5JIg_NGPx-MSIDA,5.0,0,0,0,2018-01-09 20:56:38
1,8e9HxxLjjqc9ez5ezzN7iQ,d6xvYpyzcfbF_AZ8vMB7QA,zvO-PJCpNk4fgAVUnExYAA,1.0,3,1,1,2010-10-05 19:12:35
2,Z7wgXp98wYB57QdRY3HQ3w,GYNnVehQeXjty0xH7-6Fhw,FxLfqxdYPA6Z85PFKaqLrg,4.0,0,0,0,2016-05-07 01:36:53
3,JVcjMhlavKKn3UIt9p9OXA,TpyOT5E16YASd7EWjLQlrw,AakkkTuGZA2KBodKi2_u8A,1.0,1,1,0,2012-07-16 00:37:14
4,6BnQwlxRn7ZuWdzninM9sQ,JSrP-dUmLlwZiI7Dp3PQ2A,cHdJXLlKNWixBXpDwEGb_A,3.0,1,7,1,2015-04-01 16:30:00

In [142]:
#renommer les colonnes utilisateur et restaurant
review = review.rename(columns={
    "utilisateur_id": "user_id",
    "restaurant_id": "business_id"
})

In [143]:

review = review.dropna(subset=["review_id","user_id","business_id","etoiles","useful","funny","cool","date"])
review.head()

,review_id,user_id,business_id,etoiles,useful,funny,cool,date
0,yi0R0Ugj_xUx_Nek0-_Qig,dacAIZ6fTM6mqwW5uxkskg,ikCg8xy5JIg_NGPx-MSIDA,5.0,0,0,0,2018-01-09 20:56:38
1,8e9HxxLjjqc9ez5ezzN7iQ,d6xvYpyzcfbF_AZ8vMB7QA,zvO-PJCpNk4fgAVUnExYAA,1.0,3,1,1,2010-10-05 19:12:35
2,Z7wgXp98wYB57QdRY3HQ3w,GYNnVehQeXjty0xH7-6Fhw,FxLfqxdYPA6Z85PFKaqLrg,4.0,0,0,0,2016-05-07 01:36:53
3,JVcjMhlavKKn3UIt9p9OXA,TpyOT5E16YASd7EWjLQlrw,AakkkTuGZA2KBodKi2_u8A,1.0,1,1,0,2012-07-16 00:37:14
4,6BnQwlxRn7ZuWdzninM9sQ,JSrP-dUmLlwZiI7Dp3PQ2A,cHdJXLlKNWixBXpDwEGb_A,3.0,1,7,1,2015-04-01 16:30:00

In [144]:
#Convertir la date en format datetime
review["date"] = pd.to_datetime(review["date"], errors="coerce")

review.head()

,review_id,user_id,business_id,etoiles,useful,funny,cool,date
0,yi0R0Ugj_xUx_Nek0-_Qig,dacAIZ6fTM6mqwW5uxkskg,ikCg8xy5JIg_NGPx-MSIDA,5.0,0,0,0,2018-01-09 20:56:38
1,8e9HxxLjjqc9ez5ezzN7iQ,d6xvYpyzcfbF_AZ8vMB7QA,zvO-PJCpNk4fgAVUnExYAA,1.0,3,1,1,2010-10-05 19:12:35
2,Z7wgXp98wYB57QdRY3HQ3w,GYNnVehQeXjty0xH7-6Fhw,FxLfqxdYPA6Z85PFKaqLrg,4.0,0,0,0,2016-05-07 01:36:53
3,JVcjMhlavKKn3UIt9p9OXA,TpyOT5E16YASd7EWjLQlrw,AakkkTuGZA2KBodKi2_u8A,1.0,1,1,0,2012-07-16 00:37:14
4,6BnQwlxRn7ZuWdzninM9sQ,JSrP-dUmLlwZiI7Dp3PQ2A,cHdJXLlKNWixBXpDwEGb_A,3.0,1,7,1,2015-04-01 16:30:00

In [145]:
#Nettoyer Users
user_cols = ["user_id", "nom", "elite", "nb_avis", "nb_avis_mention"]
user = user[user_cols]

user.head()

                  user_id     nom  elite  nb_avis  nb_avis_mention
0  l6BmjZMeQD3rDxWUbiAiow  Rashmi      1       95               84
1  4XChL029mKr5hydo79Ljxg   Jenna      0       33               48
2  bc8C_eETBWL0olvFSJJd0w   David      0       16               28
3  MM4RJAeH6yuaN8oZDSt0RA   Nancy      1      361             1114
4  TEtzbpgA2BFBrC0y0sCbfw   Keane      1     1122            13311

In [146]:
#Nettoyage TIP 
tip_cols = ["user_id", "business_id", "nb_compliments", "date"] 
tip = tip[tip_cols]

tip.head()

,user_id,business_id,nb_compliments,date
0,UPw5DWs_b-e2JRBS-t37Ag,VaKXUpmWTTWDKbpJ3aQdMw,0,2014-03-27 03:51:24
1,jRyO2V1pA4CdVVqCIOPc1Q,5KheTjYPu1HcQzQFtm4_vw,0,2011-12-26 01:46:17
2,FuTJWFYm4UKqewaosss1KA,TkoyGi8J7YFjA6SbaRzrxg,0,2014-03-23 21:32:49
3,CaFbX7topxdLpBJ_SNDfGQ,r49iBfbnfoK7yt4rdsL_7g,0,2016-01-05 06:39:33
4,8zXgNCkusOHMwh5Tj_8yCQ,qrSsS0pk7SL67MP5nN8tlg,0,2013-12-22 05:10:12

In [147]:
#Nettoyer Hours
hour_cols = ["lundi","mardi","mercredi","jeudi","vendredi","samedi","dimanche"]

#Retirer les lignes où toutes les heures sont vides
hours = hours.dropna(subset=hour_cols, how="all")

#Garder uniquement business_id et les colonnes d'heures
hours_cols_keep = ["business_id"] + hour_cols
hours = hours[hours_cols_keep]

hours.head()

,business_id,lundi,mardi,mercredi,jeudi,vendredi,samedi,dimanche
0,lCwqJWMxvIUQt1Re_tDn4w,0:0-0:0,0:0-0:0,0:0-0:0,0:0-0:0,0:0-0:0,0:0-0:0,0:0-0:0
1,pd0v6sOqpLhFJ7mkpIaixw,11:0-20:0,11:0-20:0,11:0-20:0,11:0-20:0,11:0-22:0,11:0-22:0,11:0-17:0
2,0vhi__HtC2L4-vScgDFdFw,11:30-22:0,11:30-22:0,11:30-22:0,11:30-22:0,11:30-22:0,12:0-22:0,16:30-21:30
3,t65yfB9v9fqlhAkLnnUXdg,11:30-21:0,11:30-21:0,11:30-21:0,11:30-21:0,11:30-21:0,NaN,11:30-21:0
4,i7_JPit-2kAbtRTLkic2jA,11:30-22:0,11:30-22:0,11:30-23:0,11:30-23:0,11:30-23:0,NaN,NaN

In [148]:
#Nettoyer Checkin
checkin["date"] = checkin["date"].fillna("").str.strip()
checkin["date_list"] = checkin["date"].apply(lambda d: d.split(",") if d != "" else [])

checkin.head()

              business_id                 date              date_list
0  --1UhMGODdWsrMastO9DZw  2016-04-26 19:49:16  [2016-04-26 19:49:16]
1  --1UhMGODdWsrMastO9DZw  2016-08-30 18:36:57  [2016-08-30 18:36:57]
2  --1UhMGODdWsrMastO9DZw  2016-10-15 02:45:18  [2016-10-15 02:45:18]
3  --1UhMGODdWsrMastO9DZw  2016-11-18 01:54:50  [2016-11-18 01:54:50]
4  --1UhMGODdWsrMastO9DZw  2017-04-20 18:39:06  [2017-04-20 18:39:06]

In [149]:
#Nettoyer Hours
hour_cols = ["lundi","mardi","mercredi",
             "jeudi","vendredi","samedi","dimanche"]
hours = hours.dropna(subset=hour_cols, how="all")

hours.head()

,business_id,lundi,mardi,mercredi,jeudi,vendredi,samedi,dimanche
0,lCwqJWMxvIUQt1Re_tDn4w,0:0-0:0,0:0-0:0,0:0-0:0,0:0-0:0,0:0-0:0,0:0-0:0,0:0-0:0
1,pd0v6sOqpLhFJ7mkpIaixw,11:0-20:0,11:0-20:0,11:0-20:0,11:0-20:0,11:0-22:0,11:0-22:0,11:0-17:0
2,0vhi__HtC2L4-vScgDFdFw,11:30-22:0,11:30-22:0,11:30-22:0,11:30-22:0,11:30-22:0,12:0-22:0,16:30-21:30
3,t65yfB9v9fqlhAkLnnUXdg,11:30-21:0,11:30-21:0,11:30-21:0,11:30-21:0,11:30-21:0,NaN,11:30-21:0
4,i7_JPit-2kAbtRTLkic2jA,11:30-22:0,11:30-22:0,11:30-23:0,11:30-23:0,11:30-23:0,NaN,NaN

In [150]:
prix = services[["business_id", "prix"]]
prix.head()

              business_id  prix
0  lCwqJWMxvIUQt1Re_tDn4w     2
1  pd0v6sOqpLhFJ7mkpIaixw     2
2  0vhi__HtC2L4-vScgDFdFw     2
3  t65yfB9v9fqlhAkLnnUXdg     1
4  i7_JPit-2kAbtRTLkic2jA     3

In [151]:
# Filtrer les filles
villes= ["Phoenix", "Las Vegas", "Toronto"]
business = business[business["ville"].isin(villes)]

business.head()

,business_id,nom,moyenne_etoiles,ville,zone,ferme
0,lCwqJWMxvIUQt1Re_tDn4w,Denny's,2.5,Las Vegas,89110,0
1,pd0v6sOqpLhFJ7mkpIaixw,Ike's Love & Sandwiches,4.0,Phoenix,85004,0
3,t65yfB9v9fqlhAkLnnUXdg,Pho U,3.5,Toronto,M5A,0
4,i7_JPit-2kAbtRTLkic2jA,John & Sons Oyster House,4.0,Toronto,M5H,0
5,vMh4madPU3qhNX7P7d8WGA,Ray's Pizza II,3.0,Phoenix,85085,0

In [152]:
# filtrer review, tip, checkin, hours selon business_id
id_validation = set(business["business_id"])
review = review[review["business_id"].isin(id_validation)]
tip = tip[tip["business_id"].isin(id_validation)]
checkin = checkin[checkin["business_id"].isin(id_validation)]
hours = hours[hours["business_id"].isin(id_validation)]

In [153]:
business.head()

,business_id,nom,moyenne_etoiles,ville,zone,ferme
0,lCwqJWMxvIUQt1Re_tDn4w,Denny's,2.5,Las Vegas,89110,0
1,pd0v6sOqpLhFJ7mkpIaixw,Ike's Love & Sandwiches,4.0,Phoenix,85004,0
3,t65yfB9v9fqlhAkLnnUXdg,Pho U,3.5,Toronto,M5A,0
4,i7_JPit-2kAbtRTLkic2jA,John & Sons Oyster House,4.0,Toronto,M5H,0
5,vMh4madPU3qhNX7P7d8WGA,Ray's Pizza II,3.0,Phoenix,85085,0

In [154]:
review.head()

,review_id,user_id,business_id,etoiles,useful,funny,cool,date
3,JVcjMhlavKKn3UIt9p9OXA,TpyOT5E16YASd7EWjLQlrw,AakkkTuGZA2KBodKi2_u8A,1.0,1,1,0,2012-07-16 00:37:14
4,6BnQwlxRn7ZuWdzninM9sQ,JSrP-dUmLlwZiI7Dp3PQ2A,cHdJXLlKNWixBXpDwEGb_A,3.0,1,7,1,2015-04-01 16:30:00
5,4bUyL7lzoWzDZaJETAKREg,_N7Ndn29bpll_961oPeEfw,y-Iw6dZflNix4BdwIyTNGA,3.0,0,0,0,2014-06-27 21:19:23
6,D_UvaenM25iNd6aehTZ0MA,8NwU4TRsD3S6gIfBqFzDMQ,Sfc8Haz2Yri8Mo1L0E0TsA,5.0,0,0,0,2012-11-06 03:41:43
7,0AsmPiAQduxh5jE_si8cLA,C_hUvw2z0R-Rv0yZb6QCZA,dm6sO_Y8JdKTE1ZM955yug,5.0,0,0,0,2014-12-17 19:04:33

In [155]:
tip.head()

,user_id,business_id,nb_compliments,date
0,UPw5DWs_b-e2JRBS-t37Ag,VaKXUpmWTTWDKbpJ3aQdMw,0,2014-03-27 03:51:24
1,jRyO2V1pA4CdVVqCIOPc1Q,5KheTjYPu1HcQzQFtm4_vw,0,2011-12-26 01:46:17
3,CaFbX7topxdLpBJ_SNDfGQ,r49iBfbnfoK7yt4rdsL_7g,0,2016-01-05 06:39:33
4,8zXgNCkusOHMwh5Tj_8yCQ,qrSsS0pk7SL67MP5nN8tlg,0,2013-12-22 05:10:12
5,DfvT4F5Eqx9Xr3Ei3GYWPg,63bHLJUomC22Xdm3IjgBtw,0,2011-10-18 18:29:05

In [156]:
checkin.head()

                business_id                 date              date_list
173  --DaPTJW3-tB1vP-PfdTEg  2012-06-03 17:46:09  [2012-06-03 17:46:09]
174  --DaPTJW3-tB1vP-PfdTEg  2012-08-04 16:19:52  [2012-08-04 16:19:52]
175  --DaPTJW3-tB1vP-PfdTEg  2012-08-04 16:26:17  [2012-08-04 16:26:17]
176  --DaPTJW3-tB1vP-PfdTEg  2012-08-06 20:14:27  [2012-08-06 20:14:27]
177  --DaPTJW3-tB1vP-PfdTEg  2012-08-09 22:17:11  [2012-08-09 22:17:11]

In [157]:
hours.head()

,business_id,lundi,mardi,mercredi,jeudi,vendredi,samedi,dimanche
0,lCwqJWMxvIUQt1Re_tDn4w,0:0-0:0,0:0-0:0,0:0-0:0,0:0-0:0,0:0-0:0,0:0-0:0,0:0-0:0
1,pd0v6sOqpLhFJ7mkpIaixw,11:0-20:0,11:0-20:0,11:0-20:0,11:0-20:0,11:0-22:0,11:0-22:0,11:0-17:0
3,t65yfB9v9fqlhAkLnnUXdg,11:30-21:0,11:30-21:0,11:30-21:0,11:30-21:0,11:30-21:0,NaN,11:30-21:0
4,i7_JPit-2kAbtRTLkic2jA,11:30-22:0,11:30-22:0,11:30-23:0,11:30-23:0,11:30-23:0,NaN,NaN
7,es3Fq9KNp6Ry994x4T4ZYg,6:30-16:0,6:30-16:0,6:30-16:0,6:30-16:0,6:30-16:0,7:0-14:0,NaN

## Vérifier les types

In [158]:
business["business_id"] = business["business_id"].astype(str)
business["nom"] = business["nom"].astype(str)
business["moyenne_etoiles"] = business["moyenne_etoiles"].astype(float)
business["ville"] = business["ville"].astype(str)
business["zone"] = business["zone"].astype(str) 
business["ferme"] = business["ferme"].astype(int)

In [159]:
business.dtypes

business_id         object
nom                 object
moyenne_etoiles    float64
ville               object
zone                object
ferme                int64
dtype: object

In [160]:
review["review_id"] = review["review_id"].astype(str)
review["user_id"] = review["user_id"].astype(str)
review["business_id"] = review["business_id"].astype(str)
review["etoiles"] = review["etoiles"].astype(float)
review["useful"] = review["useful"].astype(int)
review["funny"] = review["funny"].astype(int)
review["cool"] = review["cool"].astype(int)
review["date"] = pd.to_datetime(review["date"], errors="coerce")

In [161]:
review.dtypes

review_id              object
user_id                object
business_id            object
etoiles               float64
useful                  int64
funny                   int64
cool                    int64
date           datetime64[ns]
dtype: object

In [162]:
user["user_id"] = user["user_id"].astype(str)
user["nom"] = user["nom"].astype(str)
user["elite"] = user["elite"].astype(str)
user["nb_avis"] = user["nb_avis"].astype(int)
user["nb_avis_mention"] = user["nb_avis_mention"].astype(int)

In [163]:
user.dtypes

user_id            object
nom                object
elite              object
nb_avis             int64
nb_avis_mention     int64
dtype: object

In [164]:
hours["business_id"] = hours["business_id"].astype(str)

hour_cols = ["lundi", "mardi", "mercredi", "jeudi", "vendredi", "samedi", "dimanche"]

for col in hour_cols:
    hours[col] = hours[col].astype(str)

In [165]:
hours.dtypes

business_id    object
lundi          object
mardi          object
mercredi       object
jeudi          object
vendredi       object
samedi         object
dimanche       object
dtype: object

In [166]:
checkin["business_id"] = checkin["business_id"].astype(str)

In [167]:
checkin.dtypes

business_id    object
date           object
date_list      object
dtype: object

In [168]:
tip["user_id"] = tip["user_id"].astype(str)
tip["business_id"] = tip["business_id"].astype(str)
tip["nb_compliments"] = tip["nb_compliments"].astype(int)
tip["date"] = pd.to_datetime(tip["date"], errors="coerce")

In [169]:
tip.dtypes

user_id                   object
business_id               object
nb_compliments             int64
date              datetime64[ns]
dtype: object

In [170]:
services["business_id"] = services["business_id"].astype(str)

serviceEnInt = ["emporter","livraison","bon_pour_groupes","bon_pour_enfants","reservation","prix","terrasse"]

for col in serviceEnInt:
    services[col] = services[col].astype(int)

In [171]:
services.dtypes

business_id         object
emporter             int64
livraison            int64
bon_pour_groupes     int64
bon_pour_enfants     int64
reservation          int64
prix                 int64
terrasse             int64
dtype: object